Tekla.Structures.Drawing.Hideable.HiddenFlags
The flag for keeping track of objects hidden status.

Tekla.Structures.Drawing.Hideable.HiddenFlags.NotHidden
Not hidden.

Tekla.Structures.Drawing.Hideable.HiddenFlags.HiddenBySelf
Hidden by self (meaning nothing else is hiding it).

Tekla.Structures.Drawing.Hideable.HiddenFlags.HiddenByParent
Hidden by parent (the objects parent is hidden and thus this object is also hidden).